zhaozhouxing/ExeBoard/exeboard/module/Source/BSP/Common/stm32_Sys_I2c.c
/**
  ******************************************************************************
  * @file    stm32_eval_i2c_ee.c
  * @author  MCD Application Team
  * @version V4.2.0
  * @date    04/16/2010
  * @brief   This file provides a set of functions needed to manage the I2C M24CXX 
  *          EEPROM memory mounted on STM32xx-EVAL board (refer to stm32_eval.h
  *          to know about the boards supporting this memory). 
  *          It implements a high level communication layer for read and write 
  *          from/to this memory. The needed STM32 hardware resources (I2C and 
  *          GPIO) are defined in stm32xx_eval.h file, and the initialization is 
  *          performed in sEE_LowLevel_Init() function declared in stm32xx_eval.c 
  *          file.
  *          You can easily tailor this driver to any other development board, 
  *          by just adapting the defines for hardware resources and 
  *          sEE_LowLevel_Init() function. 
  *        
  *          @note In this driver, basic read and write functions (sEE_ReadBuffer() 
  *                and sEE_WritePage()) use the DMA to perform the data transfer 
  *                to/from EEPROM memory (except when number of requested data is
  *                equal to 1). Thus, after calling these two functions, user 
  *                application may perform other tasks while DMA is transferring
  *                data. The application should then monitor the variable holding 
  *                the number of data in order to determine when the transfer is
  *                completed (variable decremented to 0). Stopping transfer tasks
  *                are performed into DMA interrupt handlers (which are integrated
  *                into this driver).
  *            
  *     +-----------------------------------------------------------------+
  *     |                        Pin assignment                           |                 
  *     +---------------------------------------+-----------+-------------+
  *     |  STM32 I2C Pins                       |   sEE     |   Pin       |
  *     +---------------------------------------+-----------+-------------+
  *     | .                                     |   E0(GND) |    1  (0V)  |
  *     | .                                     |   E1(GND) |    2  (0V)  |
  *     | .                                     |   E2(GND) |    3  (0V)  |
  *     | .                                     |   E0(VSS) |    4  (0V)  |
  *     | HAL_I2C_SDA_PIN/ SDA                  |   SDA     |    5        |
  *     | HAL_I2C_SCL_PIN/ SCL                  |   SCL     |    6        |
  *     | .                                     |   /WC(VDD)|    7 (3.3V) |
  *     | .                                     |   VDD     |    8 (3.3V) |
  *     +---------------------------------------+-----------+-------------+  
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
  */ 

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#include    <ucos_ii.h>

#include "stm32_i2c_hal.h"

#ifdef I2C_DBG_INFO
#define dev_dbg(fmt,arg...) printf(fmt,## arg)
#else
#define dev_dbg(fmt,arg...)
#endif

/**
  * @}
  */

/** @addtogroup STM3210C_EVAL_LOW_LEVEL_I2C_EE
  * @{
  */
/**
  * @brief  I2C EEPROM Interface pins
  */  
#define HAL_I2C                          I2C1
#define HAL_I2C_CLK                      RCC_APB1Periph_I2C1
#define HAL_I2C_SCL_PIN                  GPIO_Pin_6                  /* PB.06 */
#define HAL_I2C_SCL_GPIO_PORT            GPIOB                       /* GPIOB */
#define HAL_I2C_SCL_GPIO_CLK             RCC_APB2Periph_GPIOB
#define HAL_I2C_SDA_PIN                  GPIO_Pin_7                  /* PB.07 */
#define HAL_I2C_SDA_GPIO_PORT            GPIOB                       /* GPIOB */
#define HAL_I2C_SDA_GPIO_CLK             RCC_APB2Periph_GPIOB
#define sEE_M24C64_32

#define HAL_I2C_DMA                      DMA1   
#define HAL_I2C_DMA_CHANNEL_TX           DMA1_Channel6
#define HAL_I2C_DMA_CHANNEL_RX           DMA1_Channel7 
#define HAL_I2C_DMA_FLAG_TX_TC           DMA1_IT_TC6   
#define HAL_I2C_DMA_FLAG_TX_GL           DMA1_IT_GL6 
#define HAL_I2C_DMA_FLAG_RX_TC           DMA1_IT_TC7 
#define HAL_I2C_DMA_FLAG_RX_GL           DMA1_IT_GL7    
#define HAL_I2C_DMA_CLK                  RCC_AHBPeriph_DMA1
#define HAL_I2C_DR_Address               ((uint32_t)0x40005410)
   
#define HAL_I2C_DMA_TX_IRQn              DMA1_Channel6_IRQn
#define HAL_I2C_DMA_RX_IRQn              DMA1_Channel7_IRQn
#define HAL_I2C_DMA_TX_IRQHandler        DMA1_Channel6_IRQHandler
#define HAL_I2C_DMA_RX_IRQHandler        DMA1_Channel7_IRQHandler   
#define HAL_I2C_DMA_PREPRIO              0
#define HAL_I2C_DMA_SUBPRIO              0   
   
#define HAL_I2C_DIRECTION_TX             0
#define HAL_I2C_DIRECTION_RX             1   

DMA_InitTypeDef                          sEEDMA_InitStructure; 

#define I2C_SPEED                       100000
#define I2C_SLAVE_ADDRESS7              0x35

#define HAL_I2C_ACCESS_DMA              0

#define HAL_IICSTAT_LASTBIT             (1 << 0)


enum hal_i2c_state {
    STATE_IDLE,
    STATE_START,
    STATE_READ,
    STATE_WRITE,
    STATE_STOP
};


struct hal_i2c {

    OS_EVENT            *wait;
    struct i2c_msg      *msg;
    unsigned int        msg_num;
    unsigned int        msg_idx;
    unsigned int        msg_ptr;
    int                 state ; 
    int                 tx_setup;
    struct i2c_adapter  adap;

