zhaozhouxing/ExeBoard/exeboard/module/Source/BSP/Common/stm32_Sys_I2c.c
};

static struct hal_i2c sI2C;

void halI2C_Delay(int tick)
{
    int tend = ((int)jiffies) + tick;
    while(((int)jiffies) < tend);
}


/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */

void halI2C_LowLevel_DeInit(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure; 
  NVIC_InitTypeDef NVIC_InitStructure;    
   
  /* HAL_I2C Peripheral Disable */
  I2C_Cmd(HAL_I2C, DISABLE);
 
  /* HAL_I2C DeInit */
  I2C_DeInit(HAL_I2C);

  /*!< HAL_I2C Periph clock disable */
  RCC_APB1PeriphClockCmd(HAL_I2C_CLK, DISABLE);
    
  /*!< GPIO configuration */  
  /*!< Configure HAL_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = HAL_I2C_SCL_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(HAL_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure HAL_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = HAL_I2C_SDA_PIN;
  GPIO_Init(HAL_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
  
  /* Configure and enable I2C DMA TX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = HAL_I2C_DMA_TX_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = HAL_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = HAL_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Configure and enable I2C DMA RX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = HAL_I2C_DMA_RX_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = HAL_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = HAL_I2C_DMA_SUBPRIO;
  NVIC_Init(&NVIC_InitStructure);   
  
  /* Disable and Deinitialize the DMA channels */
  DMA_Cmd(HAL_I2C_DMA_CHANNEL_TX, DISABLE);
  DMA_Cmd(HAL_I2C_DMA_CHANNEL_RX, DISABLE);
  DMA_DeInit(HAL_I2C_DMA_CHANNEL_TX);
  DMA_DeInit(HAL_I2C_DMA_CHANNEL_RX);
}


/**
  * @brief  Initializes DMA channel used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void halI2C_LowLevel_DMAConfig(uint32_t pBuffer, uint32_t BufferSize, uint32_t Direction)
{ 
  /* Initialize the DMA with the new parameters */
  if (Direction == HAL_I2C_DIRECTION_TX)
  {
    /* Configure the DMA Tx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;    
    sEEDMA_InitStructure.DMA_BufferSize = (uint32_t)BufferSize;  
    DMA_Init(HAL_I2C_DMA_CHANNEL_TX, &sEEDMA_InitStructure);  
  }
  else
  { 
    /* Configure the DMA Rx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    sEEDMA_InitStructure.DMA_BufferSize = (uint32_t)BufferSize;      
    DMA_Init(HAL_I2C_DMA_CHANNEL_RX, &sEEDMA_InitStructure);    
  }
}


/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void halI2C_LowLevel_Init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;  

  /*!< HAL_I2C_SCL_GPIO_CLK and HAL_I2C_SDA_GPIO_CLK Periph clock enable */
  RCC_APB2PeriphClockCmd(HAL_I2C_SCL_GPIO_CLK | HAL_I2C_SDA_GPIO_CLK, ENABLE);

  /*!< HAL_I2C Periph clock enable */
  RCC_APB1PeriphClockCmd(HAL_I2C_CLK, ENABLE);
    
  /*!< GPIO configuration */  
  /*!< Configure HAL_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = HAL_I2C_SCL_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init(HAL_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  /*!< Configure HAL_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = HAL_I2C_SDA_PIN;
  GPIO_Init(HAL_I2C_SDA_GPIO_PORT, &GPIO_InitStructure); 

  /* Configure and enable I2C DMA TX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = HAL_I2C_DMA_TX_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = HAL_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = HAL_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Configure and enable I2C DMA RX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = HAL_I2C_DMA_RX_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = HAL_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = HAL_I2C_DMA_SUBPRIO;
  NVIC_Init(&NVIC_InitStructure);  
  
  /*!< I2C DMA TX and RX channels configuration */
  /* Enable the DMA clock */
  RCC_AHBPeriphClockCmd(HAL_I2C_DMA_CLK, ENABLE);

  /* I2C TX DMA Channel configuration */
  DMA_DeInit(HAL_I2C_DMA_CHANNEL_TX);
  sEEDMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)HAL_I2C_DR_Address;
  sEEDMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)0;   /* This parameter will be configured durig communication */
  sEEDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;    /* This parameter will be configured durig communication */
  sEEDMA_InitStructure.DMA_BufferSize = 0xFFFF;            /* This parameter will be configured durig communication */
  sEEDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  sEEDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  sEEDMA_InitStructure.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
  sEEDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  sEEDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  sEEDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
  sEEDMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(HAL_I2C_DMA_CHANNEL_TX, &sEEDMA_InitStructure);  
  
  /* I2C RX DMA Channel configuration */
  DMA_DeInit(HAL_I2C_DMA_CHANNEL_RX);
  DMA_Init(HAL_I2C_DMA_CHANNEL_RX, &sEEDMA_InitStructure);  
  
  /* Enable the DMA Channels Interrupts */
  DMA_ITConfig(HAL_I2C_DMA_CHANNEL_TX, DMA_IT_TC, ENABLE);
  DMA_ITConfig(HAL_I2C_DMA_CHANNEL_RX, DMA_IT_TC, ENABLE);    
}


/* irq enable/disable functions */

static void halI2C_disable_irq(struct hal_i2c *i2c)
{
    I2C_ITConfig(HAL_I2C, I2C_IT_EVT | I2C_IT_BUF, DISABLE); /* use interrupt mode */

