zhaozhouxing/ExeBoard/exeboard/module/Source/BSP/Common/stm32_Sys_I2c.c
}

static void halI2C_enable_irq(struct hal_i2c *i2c)
{
    I2C_ITConfig(HAL_I2C, I2C_IT_EVT | I2C_IT_BUF, ENABLE); /* use interrupt mode */
}

static void ndelay(int delay)
{
    while(delay > 0) delay--;
}


static  int is_lastmsg(struct hal_i2c *i2c)
{
    return i2c->msg_idx >= (i2c->msg_num - 1);
}

/* is_msglast
 *
 * returns TRUE if we this is the last byte in the current message
*/

static  int is_msglast(struct hal_i2c *i2c)
{
    /* msg->len is always 1 for the first byte of smbus block read.
     * Actual length will be read from slave. More bytes will be
     * read according to the length then. */
    if (i2c->msg->flags & I2C_M_RECV_LEN && i2c->msg->len == 1)
        return 0;

    return i2c->msg_ptr == i2c->msg->len-1;
}

/* is_msgend
 *
 * returns TRUE if we reached the end of the current message
*/

static  int is_msgend(struct hal_i2c *i2c)
{
    return i2c->msg_ptr >= i2c->msg->len;
}

static  void halI2C_enable_ack(struct hal_i2c *i2c)
{
    I2C_AcknowledgeConfig(HAL_I2C, ENABLE);
}

static  void halI2C_enable_pos(struct hal_i2c *i2c)
{
    I2C_PECPositionConfig(HAL_I2C, I2C_PECPosition_Next);
}

//static  void halI2C_disable_pos(struct hal_i2c *i2c)
//{
//    I2C_PECPositionConfig(HAL_I2C, 0);
//}



static  void halI2C_disable_ack(struct hal_i2c *i2c)
{
    I2C_AcknowledgeConfig(HAL_I2C, DISABLE);
}



/* halI2C_message_start
 *
 * put the start of a message onto the bus
*/

static void halI2C_message_start(struct hal_i2c *i2c,
                      struct i2c_msg *msg)
{
    i2c->state = STATE_START;

    /* todo - check for whether ack wanted or not */
    halI2C_enable_ack(i2c);

    ndelay(sI2C.tx_setup);

    /*!< Send START condition */
    I2C_GenerateSTART(HAL_I2C, ENABLE);
}

static void halI2C_master_complete(struct hal_i2c *i2c, int ret)
{
    // dev_dbg("master_complete %d\r\n", ret);

    i2c->msg_ptr = 0;
    i2c->msg = NULL;
    i2c->msg_idx++;
    i2c->msg_num = 0;
    if (ret)
        i2c->msg_idx = ret;

    OSMboxPost(i2c->wait,(void *)1);
}



static void halI2C_stop(struct hal_i2c *i2c,int state)
{

    I2C_GenerateSTOP(HAL_I2C, ENABLE);

    i2c->state = STATE_STOP;

    halI2C_master_complete(i2c, state);
    
    halI2C_disable_irq(i2c);    

}



/* hal_i2c_irq_nextbyte
 *
 * this starts an i2c transfer
*/

static int hal_i2c_irq_nextbyte(struct hal_i2c *i2c, unsigned long iicstat,unsigned long event)
{
    unsigned char byte;
    int ret = 0;

    switch (i2c->state) {

    case STATE_IDLE:
        goto out;

    case STATE_STOP:
        halI2C_disable_irq(i2c);
        goto out_ack;
    case STATE_START:
        /* last thing we did was send a start condition on the
         * bus, or started a new i2c message
         */

        if (iicstat & HAL_IICSTAT_LASTBIT &&
            !(i2c->msg->flags & I2C_M_IGNORE_NAK)) {
            /* ack was not received... */

            halI2C_stop(i2c, -ENXIO);
            goto out_ack;
        }

        if (i2c->msg->flags & I2C_M_RD)
            i2c->state = STATE_READ;
        else
            i2c->state = STATE_WRITE;

        /* terminate the transfer if there is nothing to do
         * as this is used by the i2c probe to find devices. */

        if (is_lastmsg(i2c) && i2c->msg->len == 0) {
            halI2C_stop(i2c, 0);
            goto out_ack;
        }

        if (i2c->state == STATE_READ)
        { 
            if (2 == i2c->msg->len)
            {
                halI2C_enable_pos(i2c);
            }
            goto prepare_read;
        }

        /* fall through to the write state, as we will need to
         * send a byte as well */

    case STATE_WRITE:
        /* we are writing data to the device... check for the
         * end of the message, and if so, work out what to do
         */

        if (!(i2c->msg->flags & I2C_M_IGNORE_NAK)) {
            if (iicstat & HAL_IICSTAT_LASTBIT) {

                halI2C_stop(i2c, -ECONNREFUSED);
                goto out_ack;
            }
        }

 retry_write:

        if (!is_msgend(i2c)) {
            byte = i2c->msg->buf[i2c->msg_ptr++];

            I2C_SendData(HAL_I2C, byte); 

            /* delay after writing the byte to allow the
             * data setup time on the bus, as writing the
             * data to the register causes the first bit
             * to appear on SDA, and SCL will change as
             * soon as the interrupt is acknowledged */

            ndelay(i2c->tx_setup);

        } else if (!is_lastmsg(i2c)) {
            /* we need to go to the next i2c message */

            i2c->msg_ptr = 0;
            i2c->msg_idx++;
            i2c->msg++;

            /* check to see if we need to do another message */
            if (i2c->msg->flags & I2C_M_NOSTART) { // YLF: CHECK NEXT MESSAGE

                if (i2c->msg->flags & I2C_M_RD) {
                    /* cannot do this, the controller
                     * forces us to send a new START
                     * when we change direction */

                    halI2C_stop(i2c, -EINVALID);
                }

                goto retry_write;
            } else {
                /* send the new start */
                halI2C_message_start(i2c, i2c->msg);
                
                i2c->state = STATE_START;
            }

        } else {
            /* send stop */

            halI2C_stop(i2c, 0);
        }
        break;

    case STATE_READ:
        /* we have a byte of data in the data register, do
         * something with it, and then work out whether we are
         * going to do any more read/write
         */

        if (2 == i2c->msg->len && ((event & 0x44) == 0x44)) // RXNE 
        {
            I2C_GenerateSTOP(HAL_I2C, ENABLE);

            byte = I2C_ReceiveData(HAL_I2C);

            i2c->msg->buf[i2c->msg_ptr++] = byte;
            
            ndelay(i2c->tx_setup);

            byte = I2C_ReceiveData(HAL_I2C);
            
            i2c->msg->buf[i2c->msg_ptr++] = byte;
        }
        else if (1 == i2c->msg->len && (event & 0x40))
        {
            byte = I2C_ReceiveData(HAL_I2C);

            i2c->msg->buf[i2c->msg_ptr++] = byte;
        }
        else if ( 3 <= i2c->msg->len)
        {
            int delta = i2c->msg->len - i2c->msg_ptr;
           
            if (delta == 3)
            {
                if (!(event & 0x4))
                {
                    break;
                }
                halI2C_disable_ack(i2c);

                byte = I2C_ReceiveData(HAL_I2C);
                i2c->msg->buf[i2c->msg_ptr++] = byte;


                I2C_GenerateSTOP(HAL_I2C, ENABLE);
                
                ndelay(i2c->tx_setup);

                byte = I2C_ReceiveData(HAL_I2C);
                i2c->msg->buf[i2c->msg_ptr++] = byte;
            }
            else 
            {
                if ((event & 0x40))
                {
                    byte = I2C_ReceiveData(HAL_I2C);
                    i2c->msg->buf[i2c->msg_ptr++] = byte;
                }
            }
        }
        
 prepare_read:

        if ((event & I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) == I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED)
        {
            if (2 == i2c->msg->len) 
            {
                halI2C_disable_ack(i2c);
            }
            else if (1 == i2c->msg->len)
            {
                halI2C_disable_ack(i2c);

                I2C_GenerateSTOP(HAL_I2C, ENABLE);
            }
        }
    
