zhaozhouxing/ExeBoard/exeboard/module/Source/BSP/Common/stm32_Sys_I2c.c
        if (is_msglast(i2c)) { /* ylf: last byte of buffer */
            /* last byte of buffer */

            if (is_lastmsg(i2c))
                halI2C_disable_ack(i2c);

        } else if (is_msgend(i2c)) {
            /* ok, we've read the entire buffer, see if there
             * is anything else we need to do */

            if (is_lastmsg(i2c)) {
                /* last message, send stop and complete */
                halI2C_stop(i2c, 0);
            } else {
                /* go to the next transfer */
                i2c->msg_ptr = 0;
                i2c->msg_idx++;
                i2c->msg++;
            }
        }

        break;
    }

    /* acknowlegde the IRQ and get back on with the work */

 out_ack:
 out:
    
    return ret;
}

#ifdef HAL_I2C_DEBUG
static uint32_t teststack[8];
static uint32_t statcksize;
#endif
/**
  * @brief  irq for i2c.
  * @param  None
  * @retval None
  */
void halI2C_EV_IRQHandler(I2C_TypeDef * i2c)
{
    uint32_t event = I2C_GetLastEvent(i2c);
    {

        //==================I2C1 Master Mode Transmitter Related state===================
        if((event & I2C_EVENT_MASTER_MODE_SELECT) == I2C_EVENT_MASTER_MODE_SELECT)                      
        {

            struct i2c_msg      *msg = sI2C.msg;

            unsigned int addr = (msg->addr & 0x7f) << 1;
        
            if (msg->flags & I2C_M_RD) {
                addr |= 1;
            } 
        
            if (msg->flags & I2C_M_REV_DIR_ADDR)
                addr ^= 1; 
            
            // send slave address
            I2C_SendData(i2c, addr);

            ndelay(sI2C.tx_setup);

#ifdef HAL_I2C_DEBUG
            statcksize = 0;
#endif                      

        }
        else
        if((event & I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED) == I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)                      
        {
            hal_i2c_irq_nextbyte(&sI2C,0,event);
        }
        else
        if((event & I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED) == I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED)                      
        {
            hal_i2c_irq_nextbyte(&sI2C,0,event);
        }
        else
        if((event & I2C_EVENT_MASTER_BYTE_TRANSMITTED) == I2C_EVENT_MASTER_BYTE_TRANSMITTED)                      
        {
            hal_i2c_irq_nextbyte(&sI2C,0,event);
        }
        //else
        //if((event & I2C_EVENT_MASTER_BYTE_TRANSMITTING) == I2C_EVENT_MASTER_BYTE_TRANSMITTING)                      
        //{
        //    hal_i2c_irq_nextbyte(&sI2C,0,event);
        //}
        else
        if((event & I2C_EVENT_MASTER_BYTE_RECEIVED) == I2C_EVENT_MASTER_BYTE_RECEIVED
            || ((STATE_READ == sI2C.state) && ((event & 0x40) == 0x40)))                      
        {
            hal_i2c_irq_nextbyte(&sI2C,0,event);

        }
        else
        {
            //hal_i2c_irq_nextbyte(&sI2C,0,event);

            //if (STATE_READ == sI2C.state)
                //printf("ie:%x&%d\r\n",event,sI2C.state);
            
        }
        //printf("ie:%x&%d\r\n",event,sI2C.state);

        
#ifdef HAL_I2C_DEBUG
        if (STATE_READ == sI2C.state)
        {
            /printf("ie:%x&%d\r\n",event,sI2C.state);

            if((event & I2C_EVENT_MASTER_BYTE_TRANSMITTED) == I2C_EVENT_MASTER_BYTE_TRANSMITTED)  
            //if((event & I2C_EVENT_MASTER_BYTE_TRANSMITTING) == I2C_EVENT_MASTER_BYTE_TRANSMITTING)  
            {
                int iLoop = 0;
                for (iLoop = 0; iLoop < statcksize; iLoop++)
                {
                    printf("ie:-%x\r\n",teststack[iLoop]);
                
                }
            }
        }

        if (event != I2C_EVENT_MASTER_BYTE_TRANSMITTING)
        {
            teststack[statcksize++] = event;
            statcksize %= 8;
        }
#endif            
    }
}

/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void halI2C_DeInit(void)
{
  halI2C_LowLevel_DeInit(); 
}

/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void halI2C_Init(void)
{ 
  I2C_InitTypeDef  I2C_InitStructure;
  
  halI2C_LowLevel_Init();

  I2C_DeInit(HAL_I2C);
  
  /*!< I2C configuration */
  /* HAL_I2C configuration */
#ifdef NO_SMBUS_HOST  
  I2C_InitStructure.I2C_Mode                = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle           = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1         = I2C_SLAVE_ADDRESS7;
  I2C_InitStructure.I2C_Ack                 = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed          = I2C_SPEED;
#else
  I2C_InitStructure.I2C_Mode                = I2C_Mode_SMBusHost;
  I2C_InitStructure.I2C_DutyCycle           = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1         = I2C_SLAVE_ADDRESS7;
  I2C_InitStructure.I2C_Ack                 = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed          = I2C_SPEED;
#endif

  I2C_Init(HAL_I2C, &I2C_InitStructure);


  /* Configure and enable interrupt */
  {
      NVIC_InitTypeDef NVIC_InitStructure;  
      NVIC_InitStructure.NVIC_IRQChannel = I2C1_EV_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = HAL_I2C_DMA_PREPRIO;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = HAL_I2C_DMA_SUBPRIO;
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
      NVIC_Init(&NVIC_InitStructure);
  }
  
  I2C_Cmd(HAL_I2C, ENABLE);

  /* Enable the HAL_I2C peripheral DMA requests */
  // I2C_DMACmd(HAL_I2C, ENABLE);
  
}


/* s3c24xx_i2c_set_master
 *
 * get the i2c bus for a master transaction
*/

static int halI2C_set_master(struct hal_i2c *i2c)
{
    int timeout = 10;

    while (timeout-- > 0) {
        
        if (!I2C_GetFlagStatus(HAL_I2C, I2C_FLAG_BUSY))
            return 0;

        halI2C_Delay(1);
    }

    return -ETIMEDOUT;
}


/* s3c24xx_i2c_wait_idle
 *
 * wait for the i2c bus to become idle.
*/

static void halI2C_wait_idle(struct hal_i2c *i2c)
{

