zhaozhouxing/ExeBoard/exeboard/module/Source/BSP/Common/stm32_Sys_I2c.c
}

int wait_event_timeout(OS_EVENT  *wait , int condition, int timeout)            \
{
    if (condition)
    {
        return 0;
    }

    {
        INT16U usTo = timeout;
        INT8U  ucErr = 0;
        OSMboxPend(wait,usTo,&ucErr);

        if (ucErr)
        {
            return ucErr;
        }

        return 0;
    }
}


/* hal_i2c_doxfer
 *
 * this starts an i2c transfer
*/

static int hal_i2c_doxfer(struct hal_i2c *i2c,
                  struct i2c_msg *msgs, int num)
{
    unsigned long timeout;
    int           ret;

    ret = halI2C_set_master(i2c);
    if (ret != 0) {
        
        dev_dbg("cannot get bus (error %d)\n", ret);
        ret = -EAGAIN;
        goto out;
    }

    i2c->msg     = msgs;
    i2c->msg_num = num;
    i2c->msg_ptr = 0;
    i2c->msg_idx = 0;
    i2c->state   = STATE_START;
    
    halI2C_enable_irq(i2c);

    halI2C_message_start(i2c, msgs);

    timeout = wait_event_timeout(i2c->wait, i2c->msg_num == 0, 2000);

    ret = i2c->msg_idx;

    /* having these next two as dev_err() makes life very
     * noisy when doing an i2cdetect */

    if (timeout)
    {
        dev_dbg("timeout\n");
    }
    else if (ret != num)
    {
        dev_dbg("incomplete xfer (%d)\n", ret);
    }

    halI2C_wait_idle(i2c);
 out:

    return ret;
}




/* hal_i2c_xfer
 *
 * first port of call from the i2c bus code when an message needs
 * transferring across the i2c bus.
*/

int hal_i2c_xfer(struct i2c_adapter *adap,
            struct i2c_msg *msgs, int num)
{
    struct hal_i2c *i2c = (struct hal_i2c *)adap->algo_data;
    int retry;
    int ret;

    for (retry = 0; retry < adap->retries; retry++) {

        ret = hal_i2c_doxfer(i2c, msgs, num);

        if (ret != -EAGAIN) {
            return ret;
        }
        
        halI2C_Delay(2);
    }

    return -EREMOTEIO;
}


/* i2c bus registration info */

static const struct i2c_algorithm hal_i2c_algorithm = {
     hal_i2c_xfer,
     0,
};




struct i2c_adapter *hal_i2c_Init(void)
{
    memset(&sI2C,0,sizeof(sI2C));
    sI2C.adap.algo      = &hal_i2c_algorithm;
    sI2C.adap.timeout   = 2;
    sI2C.adap.algo_data = &sI2C;
    sI2C.adap.retries   = 2;
    sI2C.tx_setup       = 10;
    sI2C.wait           = OSMboxCreate(0); 

    halI2C_Init();

    return &sI2C.adap;
}

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
